ahtn/keyplus/ports/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Defs.h
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//Supported Devices:
//  C8051F120_GQ
//  C8051F121_GQ
//  C8051F122_GQ
//  C8051F123_GQ
//  C8051F124_GQ
//  C8051F125_GQ
//  C8051F126_GQ
//  C8051F127_GQ
//  C8051F130_GQ
//  C8051F131_GQ
//  C8051F132_GQ
//  C8051F133_GQ

#ifndef SI_C8051F120_DEFS_H
#define SI_C8051F120_DEFS_H

#include <compiler_defs.h>

//-----------------------------------------------------------------------------
// Register Definitions
//-----------------------------------------------------------------------------
SFR (ACC,      0xE0); ///< Accumulator                           
SFR (ADC0CF,   0xBC); ///< ADC0 Configuration                    
SFR (ADC0CN,   0xE8); ///< ADC0 Control                          
SFR (ADC0GTH,  0xC5); ///< ADC0 Greater-Than High Byte           
SFR (ADC0GTL,  0xC4); ///< ADC0 Greater-Than Low Byte            
SFR (ADC0H,    0xBF); ///< ADC0 Data Word High Byte              
SFR (ADC0L,    0xBE); ///< ADC0 Data Word Low Byte               
SFR (ADC0LTH,  0xC7); ///< ADC0 Less-Than High Byte              
SFR (ADC0LTL,  0xC6); ///< ADC0 Less-Than Low Byte               
SFR (ADC2,     0xBE); ///< ADC2 Data Word                        
SFR (ADC2CF,   0xBC); ///< ADC2 Configuration                    
SFR (ADC2CN,   0xE8); ///< ADC2 Control                          
SFR (ADC2GT,   0xC4); ///< ADC2 Greater-Than Data Byte           
SFR (ADC2LT,   0xC6); ///< ADC2 Less-Than Data Byte              
SFR (AMX0CF,   0xBA); ///< AMUX0 Configuration                   
SFR (AMX0SL,   0xBB); ///< AMUX0 Channel Select                  
SFR (AMX2CF,   0xBA); ///< AMUX2 Configuration                   
SFR (AMX2SL,   0xBB); ///< AMUX2 Channel Select                  
SFR (B,        0xF0); ///< B Register                            
SFR (CCH0CN,   0xA1); ///< Cache Control                         
SFR (CCH0LC,   0xA3); ///< Cache Lock Control                    
SFR (CCH0MA,   0x9A); ///< Cache Miss Accumulator                
SFR (CCH0TN,   0xA2); ///< Cache Tuning                          
SFR (CKCON,    0x8E); ///< Clock Control                         
SFR (CLKSEL,   0x97); ///< Clock Select                          
SFR (CPT0CN,   0x88); ///< Comparator 0 Control                  
SFR (CPT0MD,   0x89); ///< Comparator 0 Mode                     
SFR (CPT1CN,   0x88); ///< Comparator 1 Control                  
SFR (CPT1MD,   0x89); ///< Comparator 1 Mode                     
SFR (DAC0CN,   0xD4); ///< DAC0 Control                          
SFR (DAC0H,    0xD3); ///< DAC0 Data High Byte                   
SFR (DAC0L,    0xD2); ///< DAC0 Data Low Byte                    
SFR (DAC1CN,   0xD4); ///< DAC1 Control                          
SFR (DAC1H,    0xD3); ///< DAC1 Data High Byte                   
SFR (DAC1L,    0xD2); ///< DAC1 Data Low Byte                    
SFR (DEVICEID, 0x04); ///< JTAG Device ID                        
SFR (DPH,      0x83); ///< Data Pointer High                     
SFR (DPL,      0x82); ///< Data Pointer Low                      
SFR (EIE1,     0xE6); ///< Extended Interrupt Enable 1           
SFR (EIE2,     0xE7); ///< Extended Interrupt Enable 2           
SFR (EIP1,     0xF6); ///< Extended Interrupt Priority 1 Low     
SFR (EIP2,     0xF7); ///< Extended Interrupt Priority 2         
SFR (EMI0CF,   0xA3); ///< External Memory Configuration         
SFR (EMI0CN,   0xA2); ///< External Memory Interface Control     
SFR (EMI0TC,   0xA1); ///< External Memory Timing Control        
SFR (FLACL,    0xB7); ///< Flash Access Limit                    
SFR (FLASHADR, 0x84); ///< JTAG Flash Address                    
SFR (FLASHCON, 0x82); ///< JTAG Flash Control                    
SFR (FLASHDAT, 0x83); ///< JTAG Flash Data                       
SFR (FLSCL,    0xB7); ///< Flash Scale                           
SFR (FLSTAT,   0x88); ///< Flash Status                          
SFR (IE,       0xA8); ///< Interrupt Enable                      
SFR (IP,       0xB8); ///< Interrupt Priority                    
SFR (MAC0ACC0, 0x93); ///< Accumulator Byte 0                    
SFR (MAC0ACC1, 0x94); ///< Accumulator Byte 1                    
SFR (MAC0ACC2, 0x95); ///< Accumulator Byte 2                    
SFR (MAC0ACC3, 0x96); ///< Accumulator Byte 3                    
SFR (MAC0AH,   0xC2); ///< Operand A High Byte                   
SFR (MAC0AL,   0xC1); ///< Operand A Low Byte                    
SFR (MAC0BH,   0x92); ///< Operand B High Byte                   
SFR (MAC0BL,   0x91); ///< Operand B Low Byte                    
SFR (MAC0CF,   0xC3); ///< MAC0 Configuration                    
SFR (MAC0OVR,  0x97); ///< Accumulator Overflow Byte             
SFR (MAC0RNDH, 0xCF); ///< Rounded Result High Byte              
SFR (MAC0RNDL, 0xCE); ///< Rounded Result Low Byte               
SFR (MAC0STA,  0xC0); ///< MAC0 Status                           
SFR (OSCICL,   0x8B); ///< High Frequency Oscillator Calibration 
SFR (OSCICN,   0x8A); ///< High Frequency Oscillator Control     
SFR (OSCXCN,   0x8C); ///< External Oscillator Control           
SFR (P0,       0x80); ///< Port 0 Pin Latch                      
SFR (P0MDOUT,  0xA4); ///< Port 0 Output Mode                    
SFR (P1,       0x90); ///< Port 1 Pin Latch                      
SFR (P1MDIN,   0xAD); ///< Port 1 Input Mode                     
SFR (P1MDOUT,  0xA5); ///< Port 1 Output Mode                    
SFR (P2,       0xA0); ///< Port 2 Pin Latch                      
SFR (P2MDOUT,  0xA6); ///< Port 2 Output Mode                    
SFR (P3,       0xB0); ///< Port 3 Pin Latch                      
SFR (P3MDOUT,  0xA7); ///< Port 3 Output Mode                    
SFR (P4,       0xC8); ///< Port 4 Pin Latch                      
SFR (P4MDOUT,  0x9C); ///< Port 4 Output Mode                    
SFR (P5,       0xD8); ///< Port 5 Pin Latch                      
SFR (P5MDOUT,  0x9D); ///< Port 5 Output Mode                    
SFR (P6,       0xE8); ///< Port 6 Pin Latch                      
SFR (P6MDOUT,  0x9E); ///< Port 6 Output Mode                    
SFR (P7,       0xF8); ///< Port 7 Pin Latch                      
SFR (P7MDOUT,  0x9F); ///< Port 7 Output Mode                    
SFR (PCA0CN,   0xD8); ///< PCA Control                           
SFR (PCA0CPH0, 0xFC); ///< PCA Channel 0 Capture Module High Byte
SFR (PCA0CPH1, 0xFE); ///< PCA Channel 1 Capture Module High Byte
SFR (PCA0CPH2, 0xEA); ///< PCA Channel 2 Capture Module High Byte
SFR (PCA0CPH3, 0xEC); ///< PCA Channel 3 Capture Module High Byte
SFR (PCA0CPH4, 0xEE); ///< PCA Channel 4 Capture Module High Byte
SFR (PCA0CPH5, 0xE2); ///< PCA Channel 5 Capture Module High Byte
SFR (PCA0CPL0, 0xFB); ///< PCA Channel 0 Capture Module Low Byte 
SFR (PCA0CPL1, 0xFD); ///< PCA Channel 1 Capture Module Low Byte 
SFR (PCA0CPL2, 0xE9); ///< PCA Channel 2 Capture Module Low Byte 
SFR (PCA0CPL3, 0xEB); ///< PCA Channel 3 Capture Module Low Byte 
SFR (PCA0CPL4, 0xED); ///< PCA Channel 4 Capture Module Low Byte 
SFR (PCA0CPL5, 0xE1); ///< PCA Channel 5 Capture Module Low Byte 
SFR (PCA0CPM0, 0xDA); ///< PCA Channel 0 Capture/Compare Mode    
SFR (PCA0CPM1, 0xDB); ///< PCA Channel 1 Capture/Compare Mode    
SFR (PCA0CPM2, 0xDC); ///< PCA Channel 2 Capture/Compare Mode    
SFR (PCA0CPM3, 0xDD); ///< PCA Channel 3 Capture/Compare Mode    
SFR (PCA0CPM4, 0xDE); ///< PCA Channel 4 Capture/Compare Mode    
SFR (PCA0CPM5, 0xDF); ///< PCA Channel 5 Capture/Compare Mode    
SFR (PCA0H,    0xFA); ///< PCA Counter/Timer High Byte           
SFR (PCA0L,    0xF9); ///< PCA Counter/Timer Low Byte            
SFR (PCA0MD,   0xD9); ///< PCA Mode                              
SFR (PCON,     0x87); ///< Power Control                         
SFR (PLL0CN,   0x89); ///< PLL Control                           
SFR (PLL0DIV,  0x8D); ///< PLL Divider                           
SFR (PLL0FLT,  0x8F); ///< PLL Filter                            
SFR (PLL0MUL,  0x8E); ///< PLL Multiplier                        
SFR (PSBANK,   0xB1); ///< Program Space Bank Select             
SFR (PSCTL,    0x8F); ///< Program Store Control                 
SFR (PSW,      0xD0); ///< Program Status Word                   
SFR (RCAP2H,   0xCB); ///< Timer 2 Capture Register High Byte    
SFR (RCAP2L,   0xCA); ///< Timer 2 Capture Register Low Byte     
SFR (RCAP3H,   0xCB); ///< Timer 3 Capture Register High Byte    
SFR (RCAP3L,   0xCA); ///< Timer 3 Capture Register Low Byte     
SFR (RCAP4H,   0xCB); ///< Timer 4 Capture Register High Byte    
SFR (RCAP4L,   0xCA); ///< Timer 4 Capture Register Low Byte     
SFR (REF0CN,   0xD1); ///< Voltage Reference Control             
SFR (RSTSRC,   0xEF); ///< Reset Source                          
SFR (SADDR0,   0xA9); ///< UART0 Slave Address                   
SFR (SADEN0,   0xB9); ///< UART0 Slave Address Enable            
SFR (SBUF0,    0x99); ///< UART0 Serial Port Data Buffer         
SFR (SBUF1,    0x99); ///< UART1 Serial Port Data Buffer         
SFR (SCON0,    0x98); ///< UART0 Serial Port Control             
SFR (SCON1,    0x98); ///< UART1 Serial Port Control             
SFR (SFRLAST,  0x86); ///< SFR Page Last                         
SFR (SFRNEXT,  0x85); ///< SFR Page Next                         
SFR (SFRPAGE,  0x84); ///< SFR Page                              
SFR (SFRPGCN,  0x96); ///< SFR Page Control                      
SFR (SMB0ADR,  0xC3); ///< SMBus 0 Address                       
SFR (SMB0CN,   0xC0); ///< SMBus 0 Control                       
SFR (SMB0CR,   0xCF); ///< SMBus 0 Clock Rate                    
SFR (SMB0DAT,  0xC2); ///< SMBus 0 Data                          
SFR (SMB0STA,  0xC1); ///< SMBus 0 Status                        
SFR (SP,       0x81); ///< Stack Pointer                         
SFR (SPI0CFG,  0x9A); ///< SPI0 Configuration                    
SFR (SPI0CKR,  0x9D); ///< SPI0 Clock Rate                       
SFR (SPI0CN,   0xF8); ///< SPI0 Control                          
SFR (SPI0DAT,  0x9B); ///< SPI0 Data                             
SFR (SSTA0,    0x91); ///< UART0 Status and Clock Selection      
SFR (TCON,     0x88); ///< Timer 0/1 Control                     
SFR (TH0,      0x8C); ///< Timer 0 High Byte                     
SFR (TH1,      0x8D); ///< Timer 1 High Byte                     
SFR (TL0,      0x8A); ///< Timer 0 Low Byte                      
SFR (TL1,      0x8B); ///< Timer 1 Low Byte                      
SFR (TMOD,     0x89); ///< Timer 0/1 Mode                        
SFR (TMR2CF,   0xC9); ///< Timer 2 Configuration                 
SFR (TMR2CN,   0xC8); ///< Timer 2 Control                       
SFR (TMR2H,    0xCD); ///< Timer 2 High Byte                     
SFR (TMR2L,    0xCC); ///< Timer 2 Low Byte                      
SFR (TMR3CF,   0xC9); ///< Timer 3 Configuration                 
SFR (TMR3CN,   0xC8); ///< Timer 3 Control                       
SFR (TMR3H,    0xCD); ///< Timer 3 High Byte                     
SFR (TMR3L,    0xCC); ///< Timer 3 Low Byte                      
SFR (TMR4CF,   0xC9); ///< Timer 4 Configuration                 
SFR (TMR4CN,   0xC8); ///< Timer 4 Control                       
SFR (TMR4H,    0xCD); ///< Timer 4 High Byte                     
SFR (TMR4L,    0xCC); ///< Timer 4 Low Byte                      
SFR (WDTCN,    0xFF); ///< Watchdog Timer Control                
SFR (XBR0,     0xE1); ///< Port I/O Crossbar 0                   
SFR (XBR1,     0xE2); ///< Port I/O Crossbar 1                   
SFR (XBR2,     0xE3); ///< Port I/O Crossbar 2                   

//------------------------------------------------------------------------------
// 16-bit Register Definitions (may not work on all compilers)
//------------------------------------------------------------------------------
SFR16 (ADC0GT,  0xC4); ///< ADC0 Greater-Than            
SFR16 (ADC0,    0xBE); ///< ADC0 Data Word               
SFR16 (ADC0LT,  0xC6); ///< ADC0 Less-Than               
SFR16 (DP,      0x82); ///< Data Pointer                 
SFR16 (PCA0CP0, 0xFB); ///< PCA Channel 0 Capture Module 
SFR16 (PCA0CP1, 0xFD); ///< PCA Channel 1 Capture Module 
SFR16 (PCA0CP2, 0xE9); ///< PCA Channel 2 Capture Module 
SFR16 (PCA0CP3, 0xEB); ///< PCA Channel 3 Capture Module 
SFR16 (PCA0CP4, 0xED); ///< PCA Channel 4 Capture Module 
SFR16 (PCA0CP5, 0xE1); ///< PCA Channel 5 Capture Module 
SFR16 (PCA0,    0xF9); ///< PCA Counter/Timer            

//------------------------------------------------------------------------------
// Indirect Register Definitions
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Bit Definitions
//------------------------------------------------------------------------------

// ACC (Accumulator)
#define SFR_ACC 0xE0
SBIT (ACC_ACC0, SFR_ACC, 0); ///< Accumulator Bit 0
SBIT (ACC_ACC1, SFR_ACC, 1); ///< Accumulator Bit 1
SBIT (ACC_ACC2, SFR_ACC, 2); ///< Accumulator Bit 2
SBIT (ACC_ACC3, SFR_ACC, 3); ///< Accumulator Bit 3
SBIT (ACC_ACC4, SFR_ACC, 4); ///< Accumulator Bit 4
SBIT (ACC_ACC5, SFR_ACC, 5); ///< Accumulator Bit 5
SBIT (ACC_ACC6, SFR_ACC, 6); ///< Accumulator Bit 6
SBIT (ACC_ACC7, SFR_ACC, 7); ///< Accumulator Bit 7

// ADC0CN (ADC0 Control)
#define SFR_ADC0CN 0xE8
SBIT (ADC0CN_ADLJST, SFR_ADC0CN, 0); ///< ADC Left Justify Select              
SBIT (ADC0CN_ADWINT, SFR_ADC0CN, 1); ///< Window Compare Interrupt Flag        
SBIT (ADC0CN_ADCM0,  SFR_ADC0CN, 2); ///< Start of Conversion Mode Select Bit 0
SBIT (ADC0CN_ADCM1,  SFR_ADC0CN, 3); ///< Start of Conversion Mode Select Bit 1
SBIT (ADC0CN_ADBUSY, SFR_ADC0CN, 4); ///< ADC Busy                             
SBIT (ADC0CN_ADINT,  SFR_ADC0CN, 5); ///< Conversion Complete Interrupt Flag   
SBIT (ADC0CN_ADTM,   SFR_ADC0CN, 6); ///< ADC Track Mode                       
SBIT (ADC0CN_ADEN,   SFR_ADC0CN, 7); ///< ADC Enable                           

