ahtn/keyplus/ports/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Defs.h
// ADC2CN (ADC2 Control)
#define SFR_ADC2CN 0xE8
SBIT (ADC2CN_ADWINT, SFR_ADC2CN, 0); ///< Window Compare Interrupt Flag        
SBIT (ADC2CN_ADCM0,  SFR_ADC2CN, 1); ///< Start of Conversion Mode Select Bit 0
SBIT (ADC2CN_ADCM1,  SFR_ADC2CN, 2); ///< Start of Conversion Mode Select Bit 1
SBIT (ADC2CN_ADCM2,  SFR_ADC2CN, 3); ///< Start of Conversion Mode Select Bit 2
SBIT (ADC2CN_ADBUSY, SFR_ADC2CN, 4); ///< ADC Busy                             
SBIT (ADC2CN_ADINT,  SFR_ADC2CN, 5); ///< Conversion Complete Interrupt Flag   
SBIT (ADC2CN_ADTM,   SFR_ADC2CN, 6); ///< ADC Track Mode                       
SBIT (ADC2CN_ADEN,   SFR_ADC2CN, 7); ///< ADC Enable                           

// B (B Register)
#define SFR_B 0xF0
SBIT (B_B0, SFR_B, 0); ///< B Register Bit 0
SBIT (B_B1, SFR_B, 1); ///< B Register Bit 1
SBIT (B_B2, SFR_B, 2); ///< B Register Bit 2
SBIT (B_B3, SFR_B, 3); ///< B Register Bit 3
SBIT (B_B4, SFR_B, 4); ///< B Register Bit 4
SBIT (B_B5, SFR_B, 5); ///< B Register Bit 5
SBIT (B_B6, SFR_B, 6); ///< B Register Bit 6
SBIT (B_B7, SFR_B, 7); ///< B Register Bit 7

// CPT0CN (Comparator 0 Control)
#define SFR_CPT0CN 0x88
SBIT (CPT0CN_CPHYN0, SFR_CPT0CN, 0); ///< Comparator Negative Hysteresis Control Bit 0
SBIT (CPT0CN_CPHYN1, SFR_CPT0CN, 1); ///< Comparator Negative Hysteresis Control Bit 1
SBIT (CPT0CN_CPHYP0, SFR_CPT0CN, 2); ///< Comparator Positive Hysteresis Control Bit 0
SBIT (CPT0CN_CPHYP1, SFR_CPT0CN, 3); ///< Comparator Positive Hysteresis Control Bit 1
SBIT (CPT0CN_CPFIF,  SFR_CPT0CN, 4); ///< Comparator Falling-Edge Flag                
SBIT (CPT0CN_CPRIF,  SFR_CPT0CN, 5); ///< Comparator Rising-Edge Flag                 
SBIT (CPT0CN_CPOUT,  SFR_CPT0CN, 6); ///< Comparator Output State Flag                
SBIT (CPT0CN_CPEN,   SFR_CPT0CN, 7); ///< Comparator Enable                           

// CPT1CN (Comparator 1 Control)
#define SFR_CPT1CN 0x88
SBIT (CPT1CN_CPHYN0, SFR_CPT1CN, 0); ///< Comparator Negative Hysteresis Control Bit 0
SBIT (CPT1CN_CPHYN1, SFR_CPT1CN, 1); ///< Comparator Negative Hysteresis Control Bit 1
SBIT (CPT1CN_CPHYP0, SFR_CPT1CN, 2); ///< Comparator Positive Hysteresis Control Bit 0
SBIT (CPT1CN_CPHYP1, SFR_CPT1CN, 3); ///< Comparator Positive Hysteresis Control Bit 1
SBIT (CPT1CN_CPFIF,  SFR_CPT1CN, 4); ///< Comparator Falling-Edge Flag                
SBIT (CPT1CN_CPRIF,  SFR_CPT1CN, 5); ///< Comparator Rising-Edge Flag                 
SBIT (CPT1CN_CPOUT,  SFR_CPT1CN, 6); ///< Comparator Output State Flag                
SBIT (CPT1CN_CPEN,   SFR_CPT1CN, 7); ///< Comparator Enable                           

// FLSTAT (Flash Status)
#define SFR_FLSTAT 0x88
SBIT (FLSTAT_FLBUSY, SFR_FLSTAT, 0); ///< Flash Busy

// IE (Interrupt Enable)
#define SFR_IE 0xA8
SBIT (IE_EX0,   SFR_IE, 0); ///< External Interrupt 0 Enable
SBIT (IE_ET0,   SFR_IE, 1); ///< Timer 0 Interrupt Enable   
SBIT (IE_EX1,   SFR_IE, 2); ///< External Interrupt 1 Enable
SBIT (IE_ET1,   SFR_IE, 3); ///< Timer 1 Interrupt Enable   
SBIT (IE_ES0,   SFR_IE, 4); ///< UART0 Interrupt Enable     
SBIT (IE_ET2,   SFR_IE, 5); ///< Timer 2 Interrupt Enable   
SBIT (IE_ESPI0, SFR_IE, 6); ///< SPI0 Interrupt Enable      
SBIT (IE_IEGF0, SFR_IE, 6); ///< General Purpose Flag 0     
SBIT (IE_EA,    SFR_IE, 7); ///< All Interrupts Enable      

// IP (Interrupt Priority)
#define SFR_IP 0xB8
SBIT (IP_PX0,   SFR_IP, 0); ///< External Interrupt 0 Priority Control                        
SBIT (IP_PT0,   SFR_IP, 1); ///< Timer 0 Interrupt Priority Control                           
SBIT (IP_PX1,   SFR_IP, 2); ///< External Interrupt 1 Priority Control                        
SBIT (IP_PT1,   SFR_IP, 3); ///< Timer 1 Interrupt Priority Control                           
SBIT (IP_PS0,   SFR_IP, 4); ///< UART0 Interrupt Priority Control                             
SBIT (IP_PT2,   SFR_IP, 5); ///< Timer 2 Interrupt Priority Control                           
SBIT (IP_PSPI0, SFR_IP, 6); ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control

// MAC0STA (MAC0 Status)
#define SFR_MAC0STA 0xC0
SBIT (MAC0STA_NEGF,  SFR_MAC0STA, 0); ///< Negative Flag     
SBIT (MAC0STA_SOVF,  SFR_MAC0STA, 1); ///< Soft Overflow Flag
SBIT (MAC0STA_ZEROF, SFR_MAC0STA, 2); ///< Zero Flag         
SBIT (MAC0STA_HOVF,  SFR_MAC0STA, 3); ///< Hard Overflow Flag

// P0 (Port 0 Pin Latch)
#define SFR_P0 0x80
SBIT (P0_B0, SFR_P0, 0); ///< Port 0 Bit 0 Latch
SBIT (P0_B1, SFR_P0, 1); ///< Port 0 Bit 1 Latch
SBIT (P0_B2, SFR_P0, 2); ///< Port 0 Bit 2 Latch
SBIT (P0_B3, SFR_P0, 3); ///< Port 0 Bit 3 Latch
SBIT (P0_B4, SFR_P0, 4); ///< Port 0 Bit 4 Latch
SBIT (P0_B5, SFR_P0, 5); ///< Port 0 Bit 5 Latch
SBIT (P0_B6, SFR_P0, 6); ///< Port 0 Bit 6 Latch
SBIT (P0_B7, SFR_P0, 7); ///< Port 0 Bit 7 Latch

// P1 (Port 1 Pin Latch)
#define SFR_P1 0x90
SBIT (P1_B0, SFR_P1, 0); ///< Port 1 Bit 0 Latch
SBIT (P1_B1, SFR_P1, 1); ///< Port 1 Bit 1 Latch
SBIT (P1_B2, SFR_P1, 2); ///< Port 1 Bit 2 Latch
SBIT (P1_B3, SFR_P1, 3); ///< Port 1 Bit 3 Latch
SBIT (P1_B4, SFR_P1, 4); ///< Port 1 Bit 4 Latch
SBIT (P1_B5, SFR_P1, 5); ///< Port 1 Bit 5 Latch
SBIT (P1_B6, SFR_P1, 6); ///< Port 1 Bit 6 Latch
SBIT (P1_B7, SFR_P1, 7); ///< Port 1 Bit 7 Latch

// P2 (Port 2 Pin Latch)
#define SFR_P2 0xA0
SBIT (P2_B0, SFR_P2, 0); ///< Port 2 Bit 0 Latch
SBIT (P2_B1, SFR_P2, 1); ///< Port 2 Bit 1 Latch
SBIT (P2_B2, SFR_P2, 2); ///< Port 2 Bit 2 Latch
SBIT (P2_B3, SFR_P2, 3); ///< Port 2 Bit 3 Latch
SBIT (P2_B4, SFR_P2, 4); ///< Port 2 Bit 4 Latch
SBIT (P2_B5, SFR_P2, 5); ///< Port 2 Bit 5 Latch
SBIT (P2_B6, SFR_P2, 6); ///< Port 2 Bit 6 Latch
SBIT (P2_B7, SFR_P2, 7); ///< Port 2 Bit 7 Latch

// P3 (Port 3 Pin Latch)
#define SFR_P3 0xB0
SBIT (P3_B0, SFR_P3, 0); ///< Port 3 Bit 0 Latch
SBIT (P3_B1, SFR_P3, 1); ///< Port 3 Bit 1 Latch
SBIT (P3_B2, SFR_P3, 2); ///< Port 3 Bit 2 Latch
SBIT (P3_B3, SFR_P3, 3); ///< Port 3 Bit 3 Latch
SBIT (P3_B4, SFR_P3, 4); ///< Port 3 Bit 4 Latch
SBIT (P3_B5, SFR_P3, 5); ///< Port 3 Bit 5 Latch
SBIT (P3_B6, SFR_P3, 6); ///< Port 3 Bit 6 Latch
SBIT (P3_B7, SFR_P3, 7); ///< Port 3 Bit 7 Latch

// P4 (Port 4 Pin Latch)
#define SFR_P4 0xC8
SBIT (P4_B0, SFR_P4, 0); ///< Port 4 Bit 0 Latch
SBIT (P4_B1, SFR_P4, 1); ///< Port 4 Bit 1 Latch
SBIT (P4_B2, SFR_P4, 2); ///< Port 4 Bit 2 Latch
SBIT (P4_B3, SFR_P4, 3); ///< Port 4 Bit 3 Latch
SBIT (P4_B4, SFR_P4, 4); ///< Port 4 Bit 4 Latch
SBIT (P4_B5, SFR_P4, 5); ///< Port 4 Bit 5 Latch
SBIT (P4_B6, SFR_P4, 6); ///< Port 4 Bit 6 Latch
SBIT (P4_B7, SFR_P4, 7); ///< Port 4 Bit 7 Latch

