ahtn/keyplus/ports/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Defs.h
// P5 (Port 5 Pin Latch)
#define SFR_P5 0xD8
SBIT (P5_B0, SFR_P5, 0); ///< Port 5 Bit 0 Latch
SBIT (P5_B1, SFR_P5, 1); ///< Port 5 Bit 1 Latch
SBIT (P5_B2, SFR_P5, 2); ///< Port 5 Bit 2 Latch
SBIT (P5_B3, SFR_P5, 3); ///< Port 5 Bit 3 Latch
SBIT (P5_B4, SFR_P5, 4); ///< Port 5 Bit 4 Latch
SBIT (P5_B5, SFR_P5, 5); ///< Port 5 Bit 5 Latch
SBIT (P5_B6, SFR_P5, 6); ///< Port 5 Bit 6 Latch
SBIT (P5_B7, SFR_P5, 7); ///< Port 5 Bit 7 Latch

// P6 (Port 6 Pin Latch)
#define SFR_P6 0xE8
SBIT (P6_B0, SFR_P6, 0); ///< Port 6 Bit 0 Latch
SBIT (P6_B1, SFR_P6, 1); ///< Port 6 Bit 1 Latch
SBIT (P6_B2, SFR_P6, 2); ///< Port 6 Bit 2 Latch
SBIT (P6_B3, SFR_P6, 3); ///< Port 6 Bit 3 Latch
SBIT (P6_B4, SFR_P6, 4); ///< Port 6 Bit 4 Latch
SBIT (P6_B5, SFR_P6, 5); ///< Port 6 Bit 5 Latch
SBIT (P6_B6, SFR_P6, 6); ///< Port 6 Bit 6 Latch
SBIT (P6_B7, SFR_P6, 7); ///< Port 6 Bit 7 Latch

// P7 (Port 7 Pin Latch)
#define SFR_P7 0xF8
SBIT (P7_B0, SFR_P7, 0); ///< Port 7 Bit 0 Latch
SBIT (P7_B1, SFR_P7, 1); ///< Port 7 Bit 1 Latch
SBIT (P7_B2, SFR_P7, 2); ///< Port 7 Bit 2 Latch
SBIT (P7_B3, SFR_P7, 3); ///< Port 7 Bit 3 Latch
SBIT (P7_B4, SFR_P7, 4); ///< Port 7 Bit 4 Latch
SBIT (P7_B5, SFR_P7, 5); ///< Port 7 Bit 5 Latch
SBIT (P7_B6, SFR_P7, 6); ///< Port 7 Bit 6 Latch
SBIT (P7_B7, SFR_P7, 7); ///< Port 7 Bit 7 Latch

// PCA0CN (PCA Control)
#define SFR_PCA0CN 0xD8
SBIT (PCA0CN_CCF0, SFR_PCA0CN, 0); ///< PCA Module 0 Capture/Compare Flag
SBIT (PCA0CN_CCF1, SFR_PCA0CN, 1); ///< PCA Module 1 Capture/Compare Flag
SBIT (PCA0CN_CCF2, SFR_PCA0CN, 2); ///< PCA Module 2 Capture/Compare Flag
SBIT (PCA0CN_CCF3, SFR_PCA0CN, 3); ///< PCA Module 3 Capture/Compare Flag
SBIT (PCA0CN_CCF4, SFR_PCA0CN, 4); ///< PCA Module 4 Capture/Compare Flag
SBIT (PCA0CN_CCF5, SFR_PCA0CN, 5); ///< PCA Module 5 Capture/Compare Flag
SBIT (PCA0CN_CR,   SFR_PCA0CN, 6); ///< PCA Counter/Timer Run Control    
SBIT (PCA0CN_CF,   SFR_PCA0CN, 7); ///< PCA Counter/Timer Overflow Flag  

// PSW (Program Status Word)
#define SFR_PSW 0xD0
SBIT (PSW_PARITY, SFR_PSW, 0); ///< Parity Flag               
SBIT (PSW_F1,     SFR_PSW, 1); ///< User Flag 1               
SBIT (PSW_OV,     SFR_PSW, 2); ///< Overflow Flag             
SBIT (PSW_RS0,    SFR_PSW, 3); ///< Register Bank Select Bit 0
SBIT (PSW_RS1,    SFR_PSW, 4); ///< Register Bank Select Bit 1
SBIT (PSW_F0,     SFR_PSW, 5); ///< User Flag 0               
SBIT (PSW_AC,     SFR_PSW, 6); ///< Auxiliary Carry Flag      
SBIT (PSW_CY,     SFR_PSW, 7); ///< Carry Flag                

// SCON0 (UART0 Serial Port Control)
#define SFR_SCON0 0x98
SBIT (SCON0_RI,  SFR_SCON0, 0); ///< Receive Interrupt Flag             
SBIT (SCON0_TI,  SFR_SCON0, 1); ///< Transmit Interrupt Flag            
SBIT (SCON0_RB8, SFR_SCON0, 2); ///< Ninth Receive Bit                  
SBIT (SCON0_TB8, SFR_SCON0, 3); ///< Ninth Transmission Bit             
SBIT (SCON0_REN, SFR_SCON0, 4); ///< Receive Enable                     
SBIT (SCON0_SM2, SFR_SCON0, 5); ///< Multiprocessor Communication Enable
SBIT (SCON0_SM0, SFR_SCON0, 6); ///< Serial Port 0 Operation Mode Bit 0 
SBIT (SCON0_SM1, SFR_SCON0, 7); ///< Serial Port 0 Operation Mode Bit 1 

// SCON1 (UART1 Serial Port Control)
#define SFR_SCON1 0x98
SBIT (SCON1_RI,    SFR_SCON1, 0); ///< Receive Interrupt Flag             
SBIT (SCON1_TI,    SFR_SCON1, 1); ///< Transmit Interrupt Flag            
SBIT (SCON1_RB8,   SFR_SCON1, 2); ///< Ninth Receive Bit                  
SBIT (SCON1_TB8,   SFR_SCON1, 3); ///< Ninth Transmission Bit             
SBIT (SCON1_REN,   SFR_SCON1, 4); ///< Receive Enable                     
SBIT (SCON1_MCE,   SFR_SCON1, 5); ///< Multiprocessor Communication Enable
SBIT (SCON1_SMODE, SFR_SCON1, 7); ///< Serial Port 0 Operation Mode       

// SMB0CN (SMBus 0 Control)
#define SFR_SMB0CN 0xC0
SBIT (SMB0CN_TOE,   SFR_SMB0CN, 0); ///< SMBus Timeout Enable         
SBIT (SMB0CN_FTE,   SFR_SMB0CN, 1); ///< SMBus Free Timer Enable      
SBIT (SMB0CN_AA,    SFR_SMB0CN, 2); ///< SMBus Assert Acknowledge Flag
SBIT (SMB0CN_SI,    SFR_SMB0CN, 3); ///< SMBus Acknowledge Request    
SBIT (SMB0CN_STO,   SFR_SMB0CN, 4); ///< SMBus Stop Flag              
SBIT (SMB0CN_STA,   SFR_SMB0CN, 5); ///< SMBus Start Flag             
SBIT (SMB0CN_ENSMB, SFR_SMB0CN, 6); ///< SMBus Enable                 
SBIT (SMB0CN_BUSY,  SFR_SMB0CN, 7); ///< Busy Status Flag             

// SPI0CN (SPI0 Control)
#define SFR_SPI0CN 0xF8
SBIT (SPI0CN_SPIEN,  SFR_SPI0CN, 0); ///< SPI0 Enable            
SBIT (SPI0CN_TXBMT,  SFR_SPI0CN, 1); ///< Transmit Buffer Empty  
SBIT (SPI0CN_NSSMD0, SFR_SPI0CN, 2); ///< Slave Select Mode Bit 0
SBIT (SPI0CN_NSSMD1, SFR_SPI0CN, 3); ///< Slave Select Mode Bit 1
SBIT (SPI0CN_RXOVRN, SFR_SPI0CN, 4); ///< Receive Overrun Flag   
SBIT (SPI0CN_MODF,   SFR_SPI0CN, 5); ///< Mode Fault Flag        
SBIT (SPI0CN_WCOL,   SFR_SPI0CN, 6); ///< Write Collision Flag   
SBIT (SPI0CN_SPIF,   SFR_SPI0CN, 7); ///< SPI0 Interrupt Flag    

// TCON (Timer 0/1 Control)
#define SFR_TCON 0x88
SBIT (TCON_IT0, SFR_TCON, 0); ///< Interrupt 0 Type Select
SBIT (TCON_IE0, SFR_TCON, 1); ///< External Interrupt 0   
SBIT (TCON_IT1, SFR_TCON, 2); ///< Interrupt 1 Type Select
SBIT (TCON_IE1, SFR_TCON, 3); ///< External Interrupt 1   
SBIT (TCON_TR0, SFR_TCON, 4); ///< Timer 0 Run Control    
SBIT (TCON_TF0, SFR_TCON, 5); ///< Timer 0 Overflow Flag  
SBIT (TCON_TR1, SFR_TCON, 6); ///< Timer 1 Run Control    
SBIT (TCON_TF1, SFR_TCON, 7); ///< Timer 1 Overflow Flag  

// TMR2CN (Timer 2 Control)
#define SFR_TMR2CN 0xC8
SBIT (TMR2CN_CPRL2, SFR_TMR2CN, 0); ///< Capture/Reload Select          
SBIT (TMR2CN_CT2,   SFR_TMR2CN, 1); ///< Counter/Timer Select           
SBIT (TMR2CN_TR2,   SFR_TMR2CN, 2); ///< Timer 2 Run Control            
SBIT (TMR2CN_EXEN2, SFR_TMR2CN, 3); ///< Timer 2 External Enable        
SBIT (TMR2CN_EXF2,  SFR_TMR2CN, 6); ///< Timer 2 External Flag          
SBIT (TMR2CN_TF2,   SFR_TMR2CN, 7); ///< Timer 2 Overflow/Underflow Flag

// TMR3CN (Timer 3 Control)
#define SFR_TMR3CN 0xC8
SBIT (TMR3CN_CPRL3, SFR_TMR3CN, 0); ///< Capture/Reload Select          
SBIT (TMR3CN_CT3,   SFR_TMR3CN, 1); ///< Counter/Timer Select           
SBIT (TMR3CN_TR3,   SFR_TMR3CN, 2); ///< Timer 3 Run Control            
SBIT (TMR3CN_EXEN3, SFR_TMR3CN, 3); ///< Timer 3 External Enable        
SBIT (TMR3CN_EXF3,  SFR_TMR3CN, 6); ///< Timer 3 External Flag          
SBIT (TMR3CN_TF3,   SFR_TMR3CN, 7); ///< Timer 3 Overflow/Underflow Flag

