ahtn/keyplus/ports/efm8/efm8/mcu/C8051F120/inc/SI_C8051F120_Defs.h
// TMR4CN (Timer 4 Control)
#define SFR_TMR4CN 0xC8
SBIT (TMR4CN_CPRL4, SFR_TMR4CN, 0); ///< Capture/Reload Select          
SBIT (TMR4CN_CT4,   SFR_TMR4CN, 1); ///< Counter/Timer Select           
SBIT (TMR4CN_TR4,   SFR_TMR4CN, 2); ///< Timer 4 Run Control            
SBIT (TMR4CN_EXEN4, SFR_TMR4CN, 3); ///< Timer 4 External Enable        
SBIT (TMR4CN_EXF4,  SFR_TMR4CN, 6); ///< Timer 4 External Flag          
SBIT (TMR4CN_TF4,   SFR_TMR4CN, 7); ///< Timer 4 Overflow/Underflow Flag

//------------------------------------------------------------------------------
// Interrupt Definitions
//------------------------------------------------------------------------------
#define INT0_IRQn    0  ///< External Interrupt 0     
#define TIMER0_IRQn  1  ///< Timer 0 Overflow         
#define INT1_IRQn    2  ///< External Interrupt 1     
#define TIMER1_IRQn  3  ///< Timer 1 Overflow         
#define UART0_IRQn   4  ///< UART0                    
#define TIMER2_IRQn  5  ///< Timer 2 Overflow         
#define SPI0_IRQn    6  ///< SPI0                     
#define SMBUS0_IRQn  7  ///< SMBus 0                  
#define ADC0WC_IRQn  8  ///< ADC0 Window Compare      
#define PCA0_IRQn    9  ///< PCA0                     
#define CMP0F_IRQn   10 ///< Comparator 0 Falling Edge
#define CMP0R_IRQn   11 ///< Comparator 0 Rising Edge 
#define CMP1F_IRQn   12 ///< Comparator 1 Falling Edge
#define CMP1R_IRQn   13 ///< Comparator 1 Rising Edge 
#define TIMER3_IRQn  14 ///< Timer 3 Overflow         
#define ADC0EOC_IRQn 15 ///< ADC0 End of Conversion   
#define TIMER4_IRQn  16 ///< Timer 4 Overflow         
#define ADC2WC_IRQn  17 ///< ADC2 Window Compare      
#define ADC2EOC_IRQn 18 ///< ADC2 End of Conversion   
#define UART1_IRQn   20 ///< UART1                    

//------------------------------------------------------------------------------
// SFR Page Definitions
//------------------------------------------------------------------------------
#define ADC0_PAGE    0x00 ///< ADC0 Page                         
#define DAC0_PAGE    0x00 ///< DAC0 Page                         
#define EMI0_PAGE    0x00 ///< EMIF Page                         
#define LEGACY_PAGE  0x00 ///< Legacy SFR Page                   
#define PCA0_PAGE    0x00 ///< PCA0 Page                         
#define REF0_PAGE    0x00 ///< VREF0 Page                        
#define SMB0_PAGE    0x00 ///< SMBus 0 Page                      
#define SPI0_PAGE    0x00 ///< SPI0 Page                         
#define TIMER01_PAGE 0x00 ///< Timer 0 and Timer 1 Page          
#define TMR2_PAGE    0x00 ///< Timer 2 Page                      
#define UART0_PAGE   0x00 ///< UART0 Page                        
#define CPT0_PAGE    0x01 ///< Comparator 0 Page                 
#define DAC1_PAGE    0x01 ///< DAC1 Page                         
#define TMR3_PAGE    0x01 ///< Timer 3 Page                      
#define UART1_PAGE   0x01 ///< UART1 Page                        
#define ADC2_PAGE    0x02 ///< ADC2 Page                         
#define CPT1_PAGE    0x02 ///< Comparator 1 Page                 
#define TMR4_PAGE    0x02 ///< Timer 4 Page                      
#define MAC0_PAGE    0x03 ///< MAC Page                          
#define CONFIG_PAGE  0x0F ///< System and Port Configuration Page
#define PLL0_PAGE    0x0F ///< PLL0 Page                         

//-----------------------------------------------------------------------------
// SDCC PDATA External Memory Paging Support
//-----------------------------------------------------------------------------

#if defined SDCC

SFR(_XPAGE, 0xAA); // Point to the EMI0CN register

#endif

#endif // SI_C8051F120_DEFS_H
//-eof--------------------------------------------------------------------------

